Model: "functional_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input (InputLayer)              [(None, None)]       0                                            
__________________________________________________________________________________________________
reshape (Reshape)               (None, 1, None)      0           input[0][0]                      
__________________________________________________________________________________________________
mel_stft (Melspectrogram)       (None, 80, None, 1)  1091664     reshape[0][0]                    
__________________________________________________________________________________________________
mel_stft_norm (Normalization2D) (None, 80, None, 1)  0           mel_stft[0][0]                   
__________________________________________________________________________________________________
permute (Permute)               (None, None, 80, 1)  0           mel_stft_norm[0][0]              
__________________________________________________________________________________________________
conv2d (Conv2D)                 (None, None, 80, 10) 60          permute[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, None, 80, 10) 40          conv2d[0][0]                     
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, None, 80, 1)  51          batch_normalization[0][0]        
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, None, 80, 1)  4           conv2d_1[0][0]                   
__________________________________________________________________________________________________
squeeze_last_dim (Lambda)       (None, None, 80)     0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
bidirectional (Bidirectional)   (None, None, 128)    74240       squeeze_last_dim[0][0]           
__________________________________________________________________________________________________
bidirectional_1 (Bidirectional) (None, None, 128)    98816       bidirectional[0][0]              
__________________________________________________________________________________________________
lambda (Lambda)                 (None, 128)          0           bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense (Dense)                   (None, 128)          16512       lambda[0][0]                     
__________________________________________________________________________________________________
dot (Dot)                       (None, None)         0           dense[0][0]                      
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
attSoftmax (Softmax)            (None, None)         0           dot[0][0]                        
__________________________________________________________________________________________________
dot_1 (Dot)                     (None, 128)          0           attSoftmax[0][0]                 
                                                                 bidirectional_1[0][0]            
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 64)           8256        dot_1[0][0]                      
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 32)           2080        dense_1[0][0]                    
__________________________________________________________________________________________________
output (Dense)                  (None, 36)           1188        dense_2[0][0]                    
==================================================================================================
Total params: 1,292,911
Trainable params: 201,225
Non-trainable params: 1,091,686
__________________________________________________________________________________________________
