Model: "functional_1"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         [(None, None)]            0         
_________________________________________________________________
reshape (Reshape)            (None, 1, None)           0         
_________________________________________________________________
mel_stft (Melspectrogram)    (None, 80, None, 1)       1091664   
_________________________________________________________________
normalization2d (Normalizati (None, 80, None, 1)       0         
_________________________________________________________________
permute (Permute)            (None, None, 80, 1)       0         
_________________________________________________________________
conv2d (Conv2D)              (None, None, 80, 10)      60        
_________________________________________________________________
batch_normalization (BatchNo (None, None, 80, 10)      40        
_________________________________________________________________
conv2d_1 (Conv2D)            (None, None, 80, 1)       51        
_________________________________________________________________
batch_normalization_1 (Batch (None, None, 80, 1)       4         
_________________________________________________________________
squeeze_last_dim (Lambda)    (None, None, 80)          0         
_________________________________________________________________
bidirectional (Bidirectional (None, None, 128)         74240     
_________________________________________________________________
bidirectional_1 (Bidirection (None, 128)               98816     
_________________________________________________________________
dense (Dense)                (None, 64)                8256      
_________________________________________________________________
dense_1 (Dense)              (None, 32)                2080      
_________________________________________________________________
dense_2 (Dense)              (None, 36)                1188      
=================================================================
Total params: 1,276,399
Trainable params: 1,276,377
Non-trainable params: 22
_________________________________________________________________
